УНФ_ТЕСТ/src/Documents/ОтгрузкаТоваровИСМП/ОтгрузкаТоваровИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтгрузкаТоваровИСМП</name>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеОтгрузкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ВидыОперацийИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервичногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.ОрганизацияКонтрагентГосИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыводаИзОборота</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторГосКонтракта</name>
    <type>
      <types>DefinedType.ГосударственныеКонтрактыИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗаявкиНаОтгрузку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаНеучастнику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>DefinedType.СтавкаНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УНФ_ТЕСТ/src/Enums/ВидыОперацийИСМП/ВидыОперацийИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийИСМП</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АгрегацияИзменение</name>
  </enumValues>
  <enumValues>
    <name>АгрегацияСоздание</name>
  </enumValues>
  <enumValues>
    <name>АгрегацияУдаление</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотМаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотПолучениеПродукцииОтФизическихЛиц</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотПроизводствоВнеЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотПроизводствоРФ</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотПроизводствоРФПоДоговору</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаБезвозмезднаяПередача</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаВозвратФизическомуЛицу</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаВПроцессеРеализацииПоДоговоруРассрочки</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаИспользованиеДляСобственныхНуждПредприятия</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаКонфискацияТовара</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаКредитныйДоговор</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаЛиквидацияПредприятия</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаРеализацияКонфискованныхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаРеализацияПоДоговоруРассрочки</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаРозничнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаУничтожениеТовара</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаУтратаПовреждениеТовара</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаЭкспортВСтраныЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаЭкспортЗаПределыСтранЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаПродажаПоОбразцамДистанционнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаБрак</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаИстечениеСрокаГодности</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаЛабораторныеОбразцы</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаОтзывСРынка</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаРекламации</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаДругиеПричины</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаТестированиеПродукта</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаЭмиссиюКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаЭмиссиюКодовМаркировкиЗапросGTINНаОстатки</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаЭмиссиюКодовМаркировкиРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеПодзаказаНаЭмиссиюКодовМаркировкиСУЗ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОбИспользованииРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОбИспользованииКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОВерификацииНанесенныхКМ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПередачеКМНаПринтер</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПередачеКМНаПроизводственнуюЛинию</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПечатиКМ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПотереРаспечатанныхКМ</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеКодовМаркировкиИзСУЗ</name>
  </enumValues>
  <enumValues>
    <name>ПовторноеПолучениеКодовМаркировкиИзСУЗ</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеРезультатаОбработкиДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеРезультатаОбработкиЗаказаНаЭмиссиюКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеСтатусаПулаКодовМаркировкиИзСУЗ</name>
  </enumValues>
  <enumValues>
    <name>СписаниеВведенныхВОборотКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЭмитированныхКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПродажа</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаБезвозмезднаяПередача</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПриобретениеГосПредприятием</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаДляСобственныхНуждПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКомиссия</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаАгент</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаАннулировать</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаАннулирование</name>
  </enumValues>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПродажа</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаБезвозмезднаяПередача</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомиссия</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаАгент</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПриобретениеГосПредприятием</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаДляСобственныхНуждПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаОтклонить</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаОтклонен</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаВходящихДокументов</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборотПриРозничнойРеализации</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборотПриДистанционномСпособеПродажи</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Documents/ОтгрузкаТоваровИСМП/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ДополнительныеСвойства.Свойство("НеЗаполнятьТабличнуюЧасть") Тогда
		Товары.Очистить();
		ШтрихкодыУпаковок.Очистить();
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	ЗаполнитьОбъектПоСтатистике();
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = ИнтеграцияИС.ПустоеЗначениеОпределяемогоТипа("КонтрагентГосИС");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	НепроверяемыеРеквизиты.Добавить("ДатаВыводаИзОборота");
	НепроверяемыеРеквизиты.Добавить("ИдентификаторГосКонтракта");

	ОбязательныеРеквизиты = Новый Массив;
	Если Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаБезвозмезднаяПередача Тогда
		ОбязательныеРеквизиты.Добавить("ДатаВыводаИзОборота");
	ИначеЕсли Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаПриобретениеГосПредприятием Тогда
		
		Используется275ФЗ = Ложь;
		ИнтеграцияИСМППереопределяемый.ИспользуетсяПоддержкаПлатежейВСоответствииС275ФЗ(Используется275ФЗ);
		
		Если Используется275ФЗ Тогда
			ОбязательныеРеквизиты.Добавить("ИдентификаторГосКонтракта");
		Иначе
			Если Не ЗначениеЗаполнено(ИдентификаторГосКонтракта) Тогда
				ТекстСообщения = НСтр("ru = 'Не заполнен идентификатор гос. контракта.
				                            |Включите в настройках Поддержку платежей в соответствии с 275ФЗ
				                            |или измените вид операции документа.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Операция", , Отказ);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаДляСобственныхНуждПокупателя Тогда
		ОбязательныеРеквизиты.Добавить("ДатаВыводаИзОборота");
	КонецЕсли;
	
	НепроверяемыеРеквизиты = ОбщегоНазначенияКлиентСервер.РазностьМассивов(НепроверяемыеРеквизиты, ОбязательныеРеквизиты);
	
	ИнтеграцияИСМППереопределяемый.ПриОпределенииОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	ИнтеграцияИСМПСлужебный.ПроверитьЗаполнениеШтрихкодовУпаковок(ЭтотОбъект, Отказ);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ДатаВыводаИзОборота) И ЭтотОбъект.ДатаВыводаИзОборота < ЭтотОбъект.ДатаПервичногоДокумента Тогда
		ТекстСообщения = НСтр("ru = 'Дата вывода из оборота не может быть меньше даты первичного документа'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ДатаВыводаИзОборота", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияИСМП.ЗаписатьСтатусДокументаИСМППоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено;
	ИдентификаторЗаявкиНаОтгрузку = "";
	ШтрихкодыУпаковок.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЗаполнения

Процедура ЗаполнитьОбъектПоСтатистике()
	
	ДанныеСтатистики = ЗаполнениеОбъектовПоСтатистикеИСМП.ДанныеЗаполненияОтгрузкиТоваровИСМП(Организация);
	
	Для Каждого КлючИЗначение Из ДанныеСтатистики Цикл
		ЗаполнениеОбъектовПоСтатистикеИСМП.ЗаполнитьПустойРеквизит(ЭтотОбъект, ДанныеСтатистики, КлючИЗначение.Ключ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
